rushxrushx/rush-nuc505-uac2-withcpld/USB/descriptors_10.c
/******************************************************************************
 * @file     descriptors.c
 * @brief    NuMicro series USBD driver source file
 * @date     2017/04/26 09:30 a.m.
 *
 * @note
 * Copyright (C) 2017 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
/*!<Includes */
#include "NUC505Series.h"
#include "usbd_audio_play.h"
#include "usbd_audio_10.h"

/*
  *Speaker - Interface alternate 1~4
  +-----------+------------+----------------+------------------+
  | Alternate | Channel(s) | Bit Resolution | Sampling Rate(s) |
  +-----------+------------+----------------+------------------+
  |     1     |      2     |     16 bits    |  44.1kHz, 48kHz  |
  +-----------+------------+----------------+------------------+
  |     2     |      2     |     24 bits    |  44.1kHz, 48kHz  |
  +-----------+------------+----------------+------------------+
  |     3     |      2     |     16 bits    |      96kHz       |
  +-----------+------------+----------------+------------------+
  |     4     |      2     |     24 bits    |      96kHz       |
  +-----------+------------+----------------+------------------+
	
  Note:
  1.If you want to remove certain alternate for Speaker interface, please remove the group of 
    the alternate descriptors (Standard AS interface, Audio Streaming Class Specific Interface Descriptor, 
    Audio Streaming Format Type Descriptor, Endpoint Descriptor, Audio Streaming Class Specific Audio Data 
    Endpoint Descriptor) and modify the Total Length field of Configuration Descriptor.
    For example,
      Remove  Speaker Interface alternate 4 (24 bit resolution) from Speaker descriptor with HID 
		
      1.Remove the following descriptors for Speaker - Interface alternate 4
         Speaker - Interface alternate 4
           Standard AS interface                                         (0x09)													 
           Audio Streaming Class Specific Interface Descriptor           (0x07)	
           Audio Streaming Format Type Descriptor                        (0x0B) 
           Endpoint Descriptor                                           (0x09)	
           Audio Streaming Class Specific Audio Data Endpoint Descriptor (0x07)	
           *Interface alternate Summary                                  (0x2B)         
                         
      2.Modify the Total Length field of Configuration Descriptor
         
         0x10E(Original Total Length) - 0x2B(Total Length of descriptors for Speaker - Interface alternate 4) = 0xE3			

      3.Modify the change for interface alternate in UAC_SetInterface_10.c
				
  2.If you want to add / remove sampling rate to certain alternate for Speaker interface,
    please modify Audio Streaming Format Type Descriptor (bLength, bSamFreqType, tSamFreq fields)
    and the Total Length field of Configuration Descriptor.
    For example,
      Add 48kHz to Speaker Interface alternate 3 (16 bit resolution) from Speaker descriptor with HID   	
	
      1.Modify Audio Streaming Format Type Descriptor for Speaker Interface alternate 3

         Audio Streaming Format Type Descriptor
         +--------------------+------------------+-------------------+	
         | *bLength           |  Original Value  |   Modified Value  |			
         +--------------------+------------------+-------------------+	
         | bLength            |        0x0B      |   0x0E(+3 Bytes)  |			
         +--------------------+------------------+-------------------+					 
         | bDescriptorType    |        0x24      |        0x24       |   				
         +--------------------+------------------+-------------------+	
         | bDescriptorSubType |        0x02      |        0x02       |	
         +--------------------+------------------+-------------------+	
         | bFormatType        |        0x01      |        0x01       |		
         +--------------------+------------------+-------------------+	
         | bNrChannels        |        0x02      |        0x02       | 	
         +--------------------+------------------+-------------------+	
         | bSubFrameSize      |        0x02      |        0x02       |  			
         +--------------------+------------------+-------------------+		
         | bBitResolution     |        0x10      |        0x10       | 		
         +--------------------+------------------+-------------------+	
         | *bSamFreqType      |        0x01      | 0x02(+1 Frequency)| 			
         +--------------------+------------------+-------------------+	
         | *tSamFreq          | PLAY_RATE_96K_LO |  PLAY_RATE_96K_LO |
         |                    | PLAY_RATE_96K_MD |  PLAY_RATE_96K_MD |
         |                    | PLAY_RATE_96K_HI |  PLAY_RATE_96K_HI |
         |                    |                  |  PLAY_RATE_48K_LO |
         |                    |                  |  PLAY_RATE_48K_MD |									
         |                    |                  |  PLAY_RATE_48K_HI |
         +--------------------+------------------+-------------------+	
                         
      2.Modify the Total Length field of Configuration Descriptor

         0x10E(Original Total Length) + 0x03(The increase Length of Audio Streaming Format Type Descriptor) = 0x111	
		
  4.If you want to change the support function of audio control, please modify the bmaControls field of
    Audio Control Feature Unit Descriptor for Speaker
      A bit set to 1 indicates that the mentioned Control is supported
         0:
         D0: Mute
         D1: Volume
         D2: Bass
         D3: Mid
         D4: Treble
         D5: Graphic Equalizer
         D6: Automatic Gain
         D7: Delay
         D8: Bass Boost
         D9: Loudness
         D10..(n*8-1): Reserved		
	5.If you want to change the polling interal of HID Endpoint, please modify the bInterval field of Endpoint Descriptor for HID.
*/

