rushxrushx/rush-nuc505-uac2-withcpld/USB/descriptors_10.c
                             0x09 + (0x0C + 0x0A + 0x09) = 0x28												
                        */					
    0x01,               /* bInCollection */
    0x01,               /* baInterfaceNr(1) - Speaker */		

    /* Audio Control Input Terminal Descriptor - Speaker (Terminal ID 1) */
    0x0C,               /* bLength */
    0x24,               /* bDescriptorType:CS_INTERFACE */
    0x02,               /* bDescriptorSubType:INPUT_TERMINAL */
    0x01,               /* bTerminalID */
    0x01,0x01,          /* wTerminalType: USB streaming */
    0x00,               /* bAssocTerminal */
    0x02,               /* bNrChannels : a number that specifies how many logical audio channels are present in the cluster */
    0x03,0x00,          /* wChannelConfig: a bit field that indicates which spatial locations are present in the cluster. 
                           The bit allocations are as follows:
                             D0: Left Front (L)
                             D1: Right Front (R)
                             D2: Center Front (C)
                             D3: Low Frequency Enhancement (LFE)
                             D4: Left Surround (LS)
                             D5: Right Surround (RS)
                             D6: Left of Center (LC)
                             D7: Right of Center (RC)
                             D8: Surround (S)
                             D9: Side Left (SL)
                             D10: Side Right (SR)
                             D11: Top (T)
                             D15..12: Reserved		
                        */	
    0x00,               /* iChannelNames */
    0x00,               /* iTerminal */
		
    /* Audio Control Feature Unit Descriptor - Speaker (UNIT ID 6 - Source ID 1) */
    0x0A,               /* bLength */
    0x24,               /* bDescriptorType */
    0x06,               /* bDescriptorSubType */
    PLAY_FEATURE_UNITID,/* bUnitID */
    0x01,               /* bSourceID */
    0x01,               /* bControlSize - Size, in bytes, of the bmControls field: n */
    0x01,               /* bmaControls(0) */
                        /* A bit set to 1 indicates that the mentioned
                           Control is supported for master channel
                           0:
                           D0: Mute
                           D1: Volume
                           D2: Bass
                           D3: Mid
                           D4: Treble
                           D5: Graphic Equalizer
                           D6: Automatic Gain
                           D7: Delay
                           D8: Bass Boost
                           D9: Loudness
                           D10..(n*8-1): Reserved
                        */				
    0x02,               /* bmaControls(1) - Left */
                        /* A bit set to 1 indicates that the mentioned
                           Control is supported for master channel
                           0:
                           D0: Mute
                           D1: Volume
                           D2: Bass
                           D3: Mid
                           D4: Treble
                           D5: Graphic Equalizer
                           D6: Automatic Gain
                           D7: Delay
                           D8: Bass Boost
                           D9: Loudness
                           D10..(n*8-1): Reserved
                        */				
    0x02,               /* bmaControls(2) - Right */
                        /* A bit set to 1 indicates that the mentioned
                           Control is supported for master channel
                           0:
                           D0: Mute
                           D1: Volume
                           D2: Bass
                           D3: Mid
                           D4: Treble
                           D5: Graphic Equalizer
                           D6: Automatic Gain
                           D7: Delay
                           D8: Bass Boost
                           D9: Loudness
                           D10..(n*8-1): Reserved
                        */				
    0x00,               /* iFeature */

    /* Audio Control Output Terminal Descriptor - Speaker (UNIT ID 3 - Source ID 5) */
    0x09,               /* bLength*/
    0x24,               /* bDescriptorType:CS_INTERFACE*/
    0x03,               /* bDescriptorSubType:OUTPUT_TERMINAL*/
    0x03,               /* bTerminalID*/
    0x01,0x03,          /* wTerminalType: 0x0301 speaker*/
    0x00,               /* bAssocTerminal*/
    PLAY_FEATURE_UNITID,/* bSourceID*/
    0x00,               /* iTerminal*/

    /* Interface Descriptor - Interface 1, alternate 0 */		
    0x09,               /* bLength */
    0x04,               /* bDescriptorType */
    0x01,               /* bInterfaceNumber */
    0x00,               /* bAlternateSetting */
    0x00,               /* bNumEndpoints */
    0x01,               /* bInterfaceClass:AUDIO */
    0x02,               /* bInterfaceSubClass:AUDIOSTREAMING */
    0x00,               /* bInterfaceProtocol */
    0x00,               /* iInterface */

    /* Interface Descriptor - Interface 1, alternate 1 */		
    0x09,               /* bLength */
    0x04,               /* bDescriptorType */
    0x01,               /* bInterfaceNumber */
    0x01,               /* bAlternateSetting */
    0x02,               /* bNumEndpoints */
    0x01,               /* bInterfaceClass:AUDIO */
    0x02,               /* bInterfaceSubClass:AUDIOSTREAMING */
    0x00,               /* bInterfaceProtocol */
    0x00,               /* iInterface */

    /* Audio Streaming Class Specific Interface Descriptor (this interface's endpoint connect to Terminal ID 0x01 - Speaker) */
    0x07,               /* bLength */
    0x24,               /* bDescriptorType:CS_INTERFACE */
    0x01,               /* bDescriptorSubType:AS_GENERAL */
    0x01,               /* bTernimalLink (Speaker) */
    0x01,               /* bDelay */
    0x01,0x00,          /* wFormatTag:0x0001 PCM */

