rushxrushx/rush-nuc505-uac2-withcpld/USB/descriptors_10.c
    /* Audio Streaming Format Type Descriptor */
    0x0B,               /* bLength */
    0x24,               /* bDescriptorType:CS_INTERFACE */
    0x02,               /* bDescriptorSubType:FORMAT_TYPE */
    0x01,               /* bFormatType:FORMAT_TYPE_I */
                        /* Standard AS interface 1, alternate 1 */ 				
    0x02,               /* bNrChannels    :  2 Channels */
    0x04,               /* bSubFrameSize  :  4 bytes per sample */
    32,               /* bBitResolution : 32 bits  per sample */			
    0x01,               /* bSamFreqType : 
                           0 Continuous sampling frequency
                           1 The number of discrete sampling frequencies */		
    /* bSamFreqType  */
    (44100 & 0xFF),		
    ((44100 >> 8) & 0xFF),		
    ((44100 >> 16) & 0xFF),	
	
    
    /* Endpoint Descriptor (ISO OUT Audio Data Endpoint - alternate 1) */
    0x09,                             /* bLength */
    0x05,                             /* bDescriptorType */
    ISO_OUT_EP_NUM | EP_OUTPUT,       /* bEndpointAddress */
    0x05,//async iso                             /* bmAttributes */
    /* wMaxPacketSize note */
    384 & 0x00FF,
    (384 & 0xFF00) >> 8,
    0x01,                             /* bInterval */
    0x00,                             /* bRefresh */
    0x81,                             /* bSynchAddress */

    /* Audio Streaming Class Specific Audio Data Endpoint Descriptor */
    0x07,               /* bLength */
    0x25,               /* bDescriptorType:CS_ENDPOINT */
    0x01,               /* bDescriptorSubType:EP_GENERAL */
    0x01,               /* bmAttributes, Bit 7: MaxPacketsOnly, Bit 0: Sampling Frequency */
    0x01,               /* bLockDelayUnits */
    0x01, 0x00,         /* wLockDelay */
		
    /* Endpoint 2 - Standard Descriptor 反馈端点 */
    0x09,    /* bLength */
    0x05,         /* bDescriptorType */
    0x81,                                 /* bEndpointAddress  EPA-IN*/           
    0x01,// 连续						  /* bmAttributes */
	0x03,0x00,                      /* wMaxPacketSize 3 */   
    0x01,                                 /* bInterval */
    0x02,      //1-9，1=2ms，9=512ms      /* bRefresh */
    0x00,      //must=0                   /* bSynchAddress */
    /* 09 byte*/

#ifdef __HID__
    /* Interface Descriptor for HID */
    LEN_INTERFACE,      /* bLength */
    DESC_INTERFACE,     /* bDescriptorType */
    0x03,               /* bInterfaceNumber */
    0x00,               /* bAlternateSetting */
    0x01,               /* bNumEndpoints */
    0x03,               /* bInterfaceClass */
    0x01,               /* bInterfaceSubClass */
    0x01,               /* bInterfaceProtocol */
    0x00,               /* iInterface */

    /* HID Descriptor */
    LEN_HID,            /* Size of this descriptor in UINT8s */
    DESC_HID,           /* HID descriptor type. */
    0x10, 0x01,         /* HID Class Spec. release number.*/
    0x00,               /* H/W target country. */
    0x01,               /* Number of HID class descriptors to follow. */
    DESC_HID_RPT,       /* Dscriptor type. */

    /* Total length of report descriptor */
    HID_REPORT_DESCRIPTOR_SIZE_10 & 0x00FF,
    (HID_REPORT_DESCRIPTOR_SIZE_10 & 0xFF00) >> 8,

    /* Endpoint Descriptor (Interrupt IN Endpoint) */
    LEN_ENDPOINT,                     /* bLength */
    DESC_ENDPOINT,                    /* bDescriptorType */
    (HID_IN_EP_NUM | EP_INPUT),       /* bEndpointAddress */
    EP_INT,                           /* bmAttributes */   
    /* wMaxPacketSize */ 		
    EPC_MAX_PKT_SIZE & 0x00FF,        
    (EPC_MAX_PKT_SIZE & 0xFF00) >> 8,
    10                                /* bInterval */
#endif
};


/*!<USB Qualifier Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8QualifierDescriptor_10[] = {
#else
__align(4) uint8_t gu8QualifierDescriptor_10[] = {
#endif
    LEN_QUALIFIER,    /* bLength */
    DESC_QUALIFIER,   /* bDescriptorType */
    0x00, 0x02,       /* bcdUSB */
    0x00,             /* bDeviceClass */
    0x00,             /* bDeviceSubClass */
    0x00,             /* bDeviceProtocol */
    CEP_MAX_PKT_SIZE, /* bMaxPacketSize0 */
    0x01,             /* bNumConfigurations */
    0x00
};

/*!<USB Language String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8StringLang_10[4] = {
#else
__align(4) uint8_t gu8StringLang_10[4] = {
#endif
    4,              /* bLength */
    DESC_STRING,    /* bDescriptorType */
    0x09, 0x04
};

/*!<USB Vendor String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8VendorStringDesc_10[59] = {
#else
__align(4) uint8_t gu8VendorStringDesc_10[59] = {
#endif
    16,
    DESC_STRING,
    'N', 0, 'u', 0, 'v', 0, 'o', 0, 't', 0, 'o', 0, 'n', 0
};

/*!<USB Product String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8ProductStringDesc_10[] = {
#else
__align(4) uint8_t gu8ProductStringDesc_10[] = {
#endif	
#ifdef __HID__
    62,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '1', 0, '.', 0, '0', 0, ' ', 0,
    'S', 0, 'p', 0, 'e', 0, 'a', 0, 'k', 0, 'e', 0, 'r', 0,
    ' ', 0, '&', 0,	' ', 0, 'H', 0, 'I', 0, 'D', 0,		
#ifdef __KEYBOARD__
    '-', 0, 'K', 0, 'e', 0, 'y', 0, 'b', 0, 'o', 0, 'a', 0, 'r', 0, 'd', 0,
#else
    '-', 0, 'M', 0, 'e', 0, 'd', 0, 'i', 0, 'a', 0, 'k', 0, 'e', 0, 'y', 0,
#endif			
#else
    32,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '1', 0, '.', 0, '0', 0, ' ', 0,
    'S', 0, 'p', 0, 'e', 0, 'a', 0, 'k', 0, 'e', 0, 'r', 0
#endif	
};
/*!<USB Serial String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8StringSerial_10[] =
#else
__align(4) uint8_t gu8StringSerial_10[] =
#endif
{
    26,             // bLength
    DESC_STRING,    // bDescriptorType
    'A', 0, '0', 0, '2', 0, '0', 0, '1', 0, '6', 0, '0', 0, '8', 0, '9', 0, '0', 0, '0', 0, '0', 0
};
uint8_t *gpu8UsbString_10[4] = {
    gu8StringLang_10,
    gu8VendorStringDesc_10,
    gu8ProductStringDesc_10,
    gu8StringSerial_10,
};

uint8_t *gu8UsbHidReport_10[4] = {
    NULL,
    NULL,
    NULL,
#ifdef __HID__
    gu8KeyboardReportDesc_10
#else
    NULL
#endif
};

uint32_t gu32UsbHidReportLen_10[4] = {
    0,
    0,
    0,
#ifdef __HID__
    sizeof(gu8KeyboardReportDesc_10),
#else
		0
#endif
};

S_USBD_INFO_T gsInfo_10 = {
    gu8DeviceDescriptor_10,      /*!< Device descriptor */
    gu8ConfigDescriptor_10,      /*!< Config descriptor */
    gpu8UsbString_10,            /*!< Pointer for USB String Descriptor pointers */
    gu8QualifierDescriptor_10,   /*!< Qualifier descriptor */
    gu8ConfigDescriptor_10,      /*!< Full Speed Config descriptor */
    gu8ConfigDescriptor_10,      /*!< Other Speed Config descriptor for High Speed */
    gu8ConfigDescriptor_10,      /*!< Other Speed Config descriptor for Full Speed*/
    NULL,                        /*!< Pointer for HID CompositeDesc descriptor */
    gu8UsbHidReport_10,          /*!< Pointer for HID Report descriptor */ 
    gu32UsbHidReportLen_10,      /*!< Pointer for HID Report descriptor Size */   
};

